---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.SelectionIncludesOptionItems
source: html/f8eaa8f1-dc9c-0302-71cf-6ab07305e49c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.SelectionIncludesOptionItems Property

Elements that were already in a Design Option were selected. These will not be added to the Option Set.

## Syntax (C#)
```csharp
public static FailureDefinitionId SelectionIncludesOptionItems { get; }
```